Revit 2027 API
MassLevelData.ConceptualConstructionId Property
 The ElementId of the conceptual construction associated with the MassLevelData (Mass Floor).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ConceptualConstructionId { get; set; }
Public Property ConceptualConstructionId As ElementId
	Get
	Set
public:
property ElementId^ ConceptualConstructionId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ConceptualConstructionId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The input ElementId conceptualConstructionId is not a valid conceptual construction type ElementId.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace